 /******************************************************************************
 -- MCU显示单元 
 -- 
 --	
 --	xu
 -- 2013-06-01
 *******************************************************************************/
#ifndef __TX1CDISPLAY_H__
#define __TX1CDISPLAY_H__
#include "D:\NTools\MCU\MCUDefine.h"
/***********************************
-- TX-1C试验板数码管显示函数
-- 显示范围0~999999。负数支持以后考虑。
-- xu
-- 2013-06-01
***********************************/  
void TX1CDTDisplay(long val);
/*********************************************************************
-- 功能：TX-1C试验板数码管显示函数(十六进制)
-- 参数：pvalue=被显示数据
--		 len=数据长度(板子限制,最多显示3byte)
-- 返回：
-- 描述：xu,2013-06-16
**********************************************************************/
void TX1CDTDisplayHex(BYTE *pvalue, BYTE len);

#endif