 /******************************************************************************
 -- 单片机相关的定义 
 -- 
 --	注:
 -- 1. 数据高位存在低位地址
 --	xu
 -- 2013-06-01
 *******************************************************************************/
#ifndef __MCUDEFINE_H__
#define __MCUDEFINE_H__

////////////////////////////////////////////////////////
// 定义单片机参数
#define MCU_CLOCK_11MHZ			// 晶振的频率11.0592MHz左右
//#define MCU_CLOCK_22MHZ		// 晶振的频率22.1184MHz左右
//#define MCU_CLOCK_40MHZ		// 晶振的频率40MHz左右

////////////////////////////////////////////////////////
// 常用数据类型简写
#define BYTE 	unsigned char 
#define UINT 	unsigned int
#define ULONG 	unsigned long 
#define BOOL	char

#ifndef NULL
	#define NULL		0x0	// 空指针
#endif
#define MCU_OK		1
#define MCU_ERROR	0

/**********************************************************************
-- 简单的延时函数
-- 晶振频率为11.0592MHz，单位毫秒级。
-- xu
-- 2013-06-01
**********************************************************************/ 
void MX_Delayms(BYTE ms);
/*****************************************************************************************
	<< ---  mx_toHexChar	2014-02-13 --- >>
	说明：转换成十六进制字符“0,1,2,...E,F”
	参数：
		num = 被转换的数（0-15）
	返回值：转换后的十六进制字符'0''1'--'E''F'
*****************************************************************************************/
char mx_toHexChar(BYTE num);

#endif		   