 /******************************************************************************
 -- 在LCD设备上显示文字 
 -- 
 -- 1. 设备可显示字符的行数_LCD_ROWS_，每行能显示多少个字符_LCD_COLS_
 -- 2. 记第一个字符为左上角，坐标为(0,0)
 --	xu
 -- 2013-08-15
 *******************************************************************************/
#ifndef __LCD_H__
#define __LCD_H__

#include <reg52.h>
#include "D:\NTools\MCU\MCUDefine.h"
#define _LCD_SMC1602A_			// 长沙太阳人电子有限公司 SMC1602A型LCD

#define __NOP4__		{	_nop_();_nop_();_nop_();_nop_();	}

sbit LCDRS=P3^5;
sbit LCDEN=P3^4;
sbit LCDRW = P2^1;

#ifdef _LCD_SMC1602A_
	#define _LCD_ROWS_	2		// 显示的最大字符函数
	#define _LCD_COLS_	16		// 每行显示的字符数
#else
	#define _LCD_ROWS_	0		// 显示的最大字符函数
	#define _LCD_COLS_	0		// 每行显示的字符数
#endif


/*********************************************************************
-- 功能：往LCD设备发送指令
-- 参数：cmd=指令
-- 返回：
-- 描述：xu,2013-08-14
**********************************************************************/
void LCD_WriteCMD(BYTE cmd);

/*********************************************************************
-- 功能：在当前位置显示一个字符
-- 参数：chr=要显示的字符
-- 返回：
-- 描述：xu,2013-08-16
**********************************************************************/
void LCD_DisplayChar(char chr);

/*********************************************************************
-- 功能：初始化LCD设备
-- 参数：
-- 返回：
-- 描述：xu,2013-08-14
**********************************************************************/
void LCD_Init();

/*********************************************************************
-- 功能：初始化LCD设备，字符位置坐标
-- 参数：x=水平字符位置
-- 		 y=垂直字符位置
-- 返回：ture=定位成功，false=定位失败
-- 描述：xu,2013-08-14
**********************************************************************/
BOOL LCD_Position(int x, int y);

/*********************************************************************
-- 功能：往LCD设备输出字符，左对齐。左上角第一个字符坐标为(0,0)
-- 参数：xstart=字符水平位置起点，基于0
-- 		 ystart=字符垂直位置起点，基于0
-- 		 pstring=需要显示的字符
-- 		 cbstring=需要显示的字符数
-- 返回：
-- 描述：xu,2013-08-14
**********************************************************************/
BOOL LCD_TextOut(int xstart, int ystart, const char* pstring, int cbstring);
/*********************************************************************
-- 功能：往LCD设备以十六进制输出字符，输出字符数为cbdata*2，左上角第一个字符坐标为(0,0)
-- 参数：xstart=字符水平位置起点
-- 		 ystart=字符垂直位置起点
-- 		 vpdata=需要显示的字符
-- 		 cbdata=需要显示的字符数
-- 返回：
-- 描述：xu,2013-08-14
**********************************************************************/
BOOL LCD_TextOutHex(int xstart, int ystart, const BYTE* vpdata, int cbdata);
/*********************************************************************
-- 功能：往LCD设备输出字符，右对齐。左上角第一个字符坐标为(0,0)
-- 参数：xstart=字符水平位置起点，基于0
-- 		 ystart=字符垂直位置起点，基于0
-- 		 xspace=行所能显示的字符数
-- 		 val=需要显示的数值
-- 返回：
-- 描述：xu,2013-08-22
**********************************************************************/
BOOL LCD_ValueOut(int xstart, int ystart, BYTE xspace, int val);
BOOL LCD_ValueOut1(int xstart, int ystart, BYTE xspace, float val, BYTE dots);
#endif